<?php
/**
 * Created by PhpStorm.
 * User: Andrei
 * Date: 29.07.2017
 * Time: 11:52
 */

/*
3. Создайте на своем учебном сайте раздел "Новости". Для этого:
 - Создайте класс Article - модель одной новости
 - Создайте класс News - модель хранилища новостей (аналогично гостевой книге в предыдущем ДЗ и на уроке)
 - Две страницы сайта
	1.news.php - отображает список всех новостей. Заголовок у каждой - ссылка на страницу этой новости, под заголовком - краткий текст
	2.article.php?id=NNN - отображает новость номер NNN с полным текстом
4. При выполнении задачи 3. весь код должен быть в классах. Используйте при необходимости тайп-хинтинг. Весь вывод - через ранее созданный объект View.
 */